ruby_planning_backend/app/controllers/api/v1/groups_controller.rb

      def index
        authorize! :read
        @groups = current_user.groups
---
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = ?  [["user_id", 1]]

      def work
        authorize! :read
        @groups = current_user.groups

        result = []
        @groups = filter_done(@groups) if (params[:filter] == "true")
        @groups.each do |group|
          group.schedulings.each do |s|
---
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = ?  [["user_id", 1]]
SELECT "schedulings".* FROM "schedulings" WHERE "schedulings"."group_id" = ?  [["group_id", 4]]

      def create
        authorize! :create
        @group = Group.new(group_params)
        @group.users.push(current_user)
---
INSERT INTO "groups" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Group 1"], ["description", "desciption here"], ["created_at", "2018-07-10 13:24:20.399524"], ["updated_at", "2018-07-10 13:24:20.399524"]]

      def update
        authorize! :update
        if @group.update(group_params)
---
UPDATE "groups" SET "description" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["description", "Detta fungerar"], ["updated_at", "2018-07-11 09:50:47.569422"], ["id", 1]]

      def destroy
        authorize! :destroy
        @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]

      def set_group
        @group = current_user.groups.find(params[:id])
---
SELECT  "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = ? AND "groups"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]