ruby_planning_backend/app/controllers/api/v1/schedulings_controller.rb

      def create
        authorize! :create
        @scheduling = Scheduling.new(scheduling_params)

        if @scheduling.save
---
INSERT INTO "schedulings" ("name", "description", "start_date", "end_date", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

      def update
        authorize! :update
        if @scheduling.update(scheduling_params)
---
UPDATE "schedulings" SET "thursday" = ?, "friday" = ?, "updated_at" = ? WHERE "schedulings"."id" = ?  [["thursday", "t"], ["friday", "t"], ["updated_at", "2018-07-11 14:58:42.628418"], ["id", 1]]

      def destroy
        authorize! :destroy
        @scheduling.destroy
---
DELETE FROM "schedulings" WHERE "schedulings"."id" = ?  [["id", 3]]

      def set_group
        @group = current_user.groups.find(params[:group_id])
---
SELECT  "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = ? AND "groups"."id" = ? LIMIT ?  [["user_id", 1], ["id", 9], ["LIMIT", 1]]

      def set_scheduling
        @scheduling = @group.schedulings.find(params[:id])
---
SELECT  "schedulings".* FROM "schedulings" WHERE "schedulings"."group_id" = ? AND "schedulings"."id" = ? LIMIT ?  [["group_id", 9], ["id", 3], ["LIMIT", 1]]