ruby_planning_backend/app/controllers/api/v1/tasks_controller.rb

      def create
        authorize! :create
        @task = Task.new(task_params)

        if @task.save
---
INSERT INTO "tasks" ("name", "description", "input_type", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "task 2"], ["description", "desciption here"], ["input_type", 4], ["group_id", 4], ["created_at", "2018-07-11 12:51:59.635143"], ["updated_at", "2018-07-11 12:51:59.635143"]]

      def update
        authorize! :update
        if @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "description" = ?, "done" = ?, "input_type" = ?, "result" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", nil], ["description", nil], ["done", nil], ["input_type", nil], ["result", "testww"], ["updated_at", "2018-09-13 14:13:31.169999"], ["id", 4]]

      def destroy
        authorize! :destroy
        @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]

      def set_group
        @group = current_user.groups.find(params[:group_id])
---
SELECT  "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = ? AND "groups"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]

      def set_task
        @task = @group.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."group_id" = ? AND "tasks"."id" = ? LIMIT ?  [["group_id", 4], ["id", 3], ["LIMIT", 1]]